
class Road:        
    """Класс Покрытия дороги"""
  
    
    g = 9.8 # ускорение свободного падения

# Пустые поля для подстановки значений в них 
    
    coefficient = float   
    name_road = str

# Коэффициенты сцепления шин с дорогой:

    dry = 0.7    
    name_dry = "сухой асфальт"
                 
    wet = 0.5
    name_wet = "мокрый асфальт"
        
    sand = 0.3
    name_sand = "сухой песок"

    snow = 0.22
    name_snow = "снег"

    ice = 0.1
    name_ice = "лед"
        
    
    
   


